
<p align = center><b>Ответы на часто задаваемы вопросы</b></p>

<hr>
<p><b>Что это такое?</b>
<br>
Это информационная система "Бек-офис", разработанная в направлении Медиа Системы акад. Миание М.Ю.
</p>
<hr><p><b>Какие функции доступны?</b>
<br>
Сейчас "Бек-офис" - работает в тестовом режиме - для демонстрации возможностей - внесены тольео демонстрационные данные.<br>
<b>Сейчас работают функции бек-офиса:</b><br>
 &nbsp;&nbsp;&nbsp;- Просмотр страниц.<Br>
 &nbsp;&nbsp;&nbsp;- <a href = 'mail.php'>Обратная связь (вопрос администратору).</a><Br>
 &nbsp;&nbsp;&nbsp;- <a href = 'userinf.php'>Изменение своих данных.</a><Br>
 &nbsp;&nbsp;&nbsp;- <a href = 'change_pass.php'>Изменение пароля.</a><Br>
 &nbsp;&nbsp;&nbsp;- <a href = 'team.php'>Просмотр списка команды (механизм МЛМ).</a><Br>
 &nbsp;&nbsp;&nbsp;- <a href = 'team.php'>Возможность получить ссылку</a>, по которой люди смогут регистрироваться в "Бек-офисе" под вас.<Br>	<Br>
<b>Функции, которые принципиально реализованы в бек-офисе:</b> <br>
 &nbsp;&nbsp;&nbsp;- <a href = 'photo.php'>Просмотр фотографий</a> с мероприятий и заказ на скачивание или печать.<br>
 &nbsp;&nbsp;&nbsp;- Просмотр презентаций по обучающим курсам.<br>
 &nbsp;&nbsp;&nbsp;- Дистанционное обучение в видеорежиме.<br>
</p>
<hr><p><b>Что планируется дальше?</b>
<br>
Планируется развивать этот проект - добавлять к нему новые обучающие курсы и модули, в том числе модуль заказа Интернет-рекламы, видеопродукции, возможности преставить свои предложения, др.
<br>Заказы и предлжоения по новым функциям - <a href = 'mail.php'>принимаются с благодарностью</a>.
</p>



